test/test_Ergun_liquid_solid/mix_semi/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

  wall
  {
    // type            fixedValue;
    // value           uniform (0 0 0);
    type            noSlip;
  }

  inlet
  {
    /*
    type            uniformFixedValue;
    uniformValue    table
    (
      (0.0 (0 0 0.0001))
      (0.5 (0 0 0.006))
    );
    */
    type            zeroGradient;
  }

  outlet
  {
    type            zeroGradient;
  }
}
