test/test_Ergun_liquid_solid/mix_semi/CFD/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  wall
  {
    type            zeroGradient;
  }
  inlet
  {
    /*
    type            fixedValue;
    value           0.03924;
    */

    type            uniformFixedValue;
    uniformValue    table
    (
      (0.0 0.01903) // 0.1
      (0.1 0.01903)
      (0.12 0.03806) // 0.2
      (0.17 0.03806)
      (0.19 0.05709) // 0.3
      (0.24 0.05709)
      (0.26 0.07612) // 0.4
      (0.31 0.07612)
      (0.33 0.09514) // 0.5
      (0.38 0.09514)
      (0.40 0.11418) // 0.6
      (0.45 0.11418)
      (0.47 0.12369) // 0.65
      (0.52 0.12369)
      (0.54 0.13321) // 0.7
      (0.59 0.13321)
      (0.61 0.14272) // 0.75
      (0.68 0.14272)
      (0.70 0.15224) // 0.8
      (0.77 0.15224)
      (0.79 0.16175) // 0.85
      (0.87 0.16175)
      (0.89 0.17127) // 0.9
      (0.98 0.17127)
    );

    /*
    type            fixedValue;
    value           0.17793; // 0.935
    */

    /*
    type            fixedValue;
    value           0.17888; // 0.94
    */

    /*
    type            uniformFixedValue;
    uniformValue    table
    (
      (0.0 0.18268) // 0.96
      (0.4 0.18268)
      (0.42 0.18459) // 0.97
      (0.9 0.18459)
      (0.92 0.18649) // 0.98
      (1.42 0.18649)
      (1.44 0.18839) // 0.99
      (2.0 0.18839)
    );
    */

    /*
    type            uniformFixedValue;
    uniformValue    table
    (
      (0.0 0.17127) // 0.9
      (0.2 0.17127)
      (0.22 0.17508) // 0.92
      (0.32 0.17508)
      (0.34 0.17888) // 0.94
      (0.44 0.17888)
    );
    */
  }
  outlet
  {
    type            fixedValue;
    value           $internalField;
  }
}
